/*
#############################################################################################
# All Points Bulletin Reloaded (1.6) SDK
# Generated with TheFeckless UE3 SDK Generator v1.2_Beta-Rev.39
# ========================================================================================= #
# File: APBUserInterface_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net	
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function APBUserInterface.cUIAction_HostingOp.ExportErrorMessage
// [0x00020400] ( FUNC_Native )
struct UcUIAction_HostingOp_execExportErrorMessage_Parms
{
};

// Function APBUserInterface.cUIAction_HostingOp.ResetErrorMessage
// [0x00020802] ( FUNC_Event )
struct UcUIAction_HostingOp_eventResetErrorMessage_Parms
{
};

// Function APBUserInterface.cUIAction_HostingOp.OnFadeCompleted
// [0x00020002] 
struct UcUIAction_HostingOp_execOnFadeCompleted_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIAction_HostingOp.SetupScene
// [0x00020802] ( FUNC_Event )
struct UcUIAction_HostingOp_eventSetupScene_Parms
{
	class UcUIScene_BaseScene*                         Scene;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class UUILabel*                                 Lbl;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
	// class UUIPanel*                                 Pnl;                                              		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function APBUserInterface.cSDDUI.CastPopupDialogCategory
// [0x00022102] 
struct UcSDDUI_execCastPopupDialogCategory_Parms
{
	int                                                I;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cSDDUI.CastPopupDialogArea
// [0x00022102] 
struct UcSDDUI_execCastPopupDialogArea_Parms
{
	int                                                I;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cSDDUI.CastHUDUsables_DisplaySetting
// [0x00022102] 
struct UcSDDUI_execCastHUDUsables_DisplaySetting_Parms
{
	int                                                I;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cSDDUI.CastChatMessageCategory
// [0x00022102] 
struct UcSDDUI_execCastChatMessageCategory_Parms
{
	int                                                I;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cSDDUI.CastChatCommandWorksFromState
// [0x00022102] 
struct UcSDDUI_execCastChatCommandWorksFromState_Parms
{
	int                                                I;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cSDDUI.CastChatCommandType
// [0x00022102] 
struct UcSDDUI_execCastChatCommandType_Parms
{
	int                                                I;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUI_Soc_GroupAccept.InviteAccepted
// [0x00020400] ( FUNC_Native )
struct UcUI_Soc_GroupAccept_execInviteAccepted_Parms
{
	unsigned char                                      Answer;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUI_Soc_GroupAccept.InviteReceived
// [0x00020400] ( FUNC_Native )
struct UcUI_Soc_GroupAccept_execInviteReceived_Parms
{
	struct FString                                     sPlayerName;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function APBUserInterface.cUI_TM_TeamInviteAccept.InviteAccepted
// [0x00020400] ( FUNC_Native )
struct UcUI_TM_TeamInviteAccept_execInviteAccepted_Parms
{
	unsigned char                                      Answer;                                           		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUI_TM_TeamInviteAccept.InviteReceived
// [0x00020400] ( FUNC_Native )
struct UcUI_TM_TeamInviteAccept_execInviteReceived_Parms
{
	struct FString                                     sPlayerName;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sTeamName;                                        		// 0x000C (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function APBUserInterface.cUIAction_CharacterCreate.OnCharacterCreateFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_CharacterCreate_execOnCharacterCreateFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_CharacterCreate.OnCharacterCreateSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_CharacterCreate_execOnCharacterCreateSuccess_Parms
{
	int                                                nSlotNumber;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_CharacterDelete.OnCharacterDeleteFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_CharacterDelete_execOnCharacterDeleteFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_CharacterDelete.OnCharacterDeleteSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_CharacterDelete_execOnCharacterDeleteSuccess_Parms
{
};

// Function APBUserInterface.cUIAction_CharacterInfo.OnCharacterInfoFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_CharacterInfo_execOnCharacterInfoFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_CharacterInfo.OnCharacterInfoSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_CharacterInfo_execOnCharacterInfoSuccess_Parms
{
};

// Function APBUserInterface.cUIAction_CharacterNameCheck.OnNameCheckFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_CharacterNameCheck_execOnNameCheckFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_CharacterNameCheck.OnNameCheckSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_CharacterNameCheck_execOnNameCheckSuccess_Parms
{
};

// Function APBUserInterface.cUIAction_CompString.HasDynamicOutputLinks
// [0x00022802] ( FUNC_Event )
struct UcUIAction_CompString_eventHasDynamicOutputLinks_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIAction_CompString.IsValidLevelSequenceObject
// [0x00020802] ( FUNC_Event )
struct UcUIAction_CompString_eventIsValidLevelSequenceObject_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIAction_DisplayTextEntry.OnBoxClosed
// [0x00020002] 
struct UcUIAction_DisplayTextEntry_execOnBoxClosed_Parms
{
	unsigned long                                      bInAcceptOk : 1;                                  		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_DisplayTextEntry.SetupScene
// [0x00020802] ( FUNC_Event )
struct UcUIAction_DisplayTextEntry_eventSetupScene_Parms
{
	class UcUIScene_TextEntry*                         Scene;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_DistrictEnter.ShowLoadingScreen
// [0x00020400] ( FUNC_Native )
struct UcUIAction_DistrictEnter_execShowLoadingScreen_Parms
{
	unsigned long                                      bShow : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_DistrictEnter.CharacterGetInfoFailure
// [0x00020400] ( FUNC_Native )
struct UcUIAction_DistrictEnter_execCharacterGetInfoFailure_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sCharacterName;                                   		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function APBUserInterface.cUIAction_DistrictEnter.CharacterGetInfoSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_DistrictEnter_execCharacterGetInfoSuccess_Parms
{
	int                                                nCharacterUID;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nDistrictUID;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nInstanceNo;                                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      eFaction;                                         		// 0x000C (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     sCharacterName;                                   		// 0x0010 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function APBUserInterface.cUIAction_DistrictEnter.JoinPlayer
// [0x00020400] ( FUNC_Native )
struct UcUIAction_DistrictEnter_execJoinPlayer_Parms
{
	struct FString                                     sPlayerName;                                      		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function APBUserInterface.cUIAction_DistrictEnter.DistrictReserve
// [0x00020400] ( FUNC_Native )
struct UcUIAction_DistrictEnter_execDistrictReserve_Parms
{
};

// Function APBUserInterface.cUIAction_DistrictEnter.OnWorldServerDisconnect
// [0x00020400] ( FUNC_Native )
struct UcUIAction_DistrictEnter_execOnWorldServerDisconnect_Parms
{
};

// Function APBUserInterface.cUIAction_DistrictEnter.OnDistrictEnterFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_DistrictEnter_execOnDistrictEnterFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_DistrictEnter.OnDistrictEnterSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_DistrictEnter_execOnDistrictEnterSuccess_Parms
{
};

// Function APBUserInterface.cUIAction_DistrictEnter.OnDistrictReserveFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_DistrictEnter_execOnDistrictReserveFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nDistrictUID;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                nInstanceNo;                                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bGroup : 1;                                       		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_DistrictEnter.OnDistrictReserveSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_DistrictEnter_execOnDistrictReserveSuccess_Parms
{
};

// Function APBUserInterface.cUIAction_DM_HandleInput.OnPlayerSpawnTimerExpired
// [0x00020400] ( FUNC_Native )
struct UcUIAction_DM_HandleInput_execOnPlayerSpawnTimerExpired_Parms
{
};

// Function APBUserInterface.cUIAction_ForceGC.IsValidUISequenceObject
// [0x00020802] ( FUNC_Event )
struct UcUIAction_ForceGC_eventIsValidUISequenceObject_Parms
{
	class UUIScreenObject*                             TargetObject;                                     		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIAction_FullScreenMoviePlayer.InputKey
// [0x00020400] ( FUNC_Native )
struct UcUIAction_FullScreenMoviePlayer_execInputKey_Parms
{
	int                                                ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       Key;                                              		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      EventType;                                        		// 0x000C (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              AmountDepressed;                                  		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bGamepad : 1;                                     		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIAction_GetInstanceList.OnGetInstanceListFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_GetInstanceList_execOnGetInstanceListFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_GetInstanceList.OnGetInstanceListSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_GetInstanceList_execOnGetInstanceListSuccess_Parms
{
};

// Function APBUserInterface.cUIAction_GetKeyPress.InputKey_UIWidget
// [0x00420400] ( FUNC_Native )
struct UcUIAction_GetKeyPress_execInputKey_UIWidget_Parms
{
	struct FInputEventParameters                       EventParms;                                       		// 0x0000 (0x0020) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIAction_GetKeyPress.OldInputKeyDelegate_UIWidget
// [0x00520000] 
struct UcUIAction_GetKeyPress_execOldInputKeyDelegate_UIWidget_Parms
{
	struct FInputEventParameters                       EventParms;                                       		// 0x0000 (0x0020) [0x0000000000000182]              ( CPF_Const | CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIAction_GetKeyPress.InputKey_Global
// [0x00020400] ( FUNC_Native )
struct UcUIAction_GetKeyPress_execInputKey_Global_Parms
{
	int                                                ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       Key;                                              		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      EventType;                                        		// 0x000C (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              AmountDepressed;                                  		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bGamepad : 1;                                     		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIAction_GetKeyPress.OldInputKeyDelegate_Global
// [0x00120000] 
struct UcUIAction_GetKeyPress_execOldInputKeyDelegate_Global_Parms
{
	int                                                ControllerId;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FName                                       Key;                                              		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      EventType;                                        		// 0x000C (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              AmountDepressed;                                  		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bGamepad : 1;                                     		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIAction_GetWorldList.OnGetWorldListFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_GetWorldList_execOnGetWorldListFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_GetWorldList.OnGetWorldListSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_GetWorldList_execOnGetWorldListSuccess_Parms
{
};

// Function APBUserInterface.cUIAction_HasTutorialBeenPlayed.GetObjClassVersion
// [0x00022802] ( FUNC_Event )
struct UcUIAction_HasTutorialBeenPlayed_eventGetObjClassVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIAction_LaunchGameFlowScene.ClientInvokeCityMap
// [0x00020400] ( FUNC_Native )
struct UcUIAction_LaunchGameFlowScene_execClientInvokeCityMap_Parms
{
};

// Function APBUserInterface.cUIAction_LaunchGameFlowScene.ClientNotReturningToLobby
// [0x00020400] ( FUNC_Native )
struct UcUIAction_LaunchGameFlowScene_execClientNotReturningToLobby_Parms
{
};

// Function APBUserInterface.cUIAction_LaunchGameFlowScene.OnFastLoginFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_LaunchGameFlowScene_execOnFastLoginFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_LaunchGameFlowScene.OnFastLoginSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_LaunchGameFlowScene_execOnFastLoginSuccess_Parms
{
	int                                                nPoints;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_Login.OnLoginFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_Login_execOnLoginFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_Login.OnLoginSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_Login_execOnLoginSuccess_Parms
{
	int                                                nPoints;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_Logout.OnDisconnected
// [0x00020400] ( FUNC_Native )
struct UcUIAction_Logout_execOnDisconnected_Parms
{
};

// Function APBUserInterface.cUIAction_OpenFileSelector.SelectionDone
// [0x00020400] ( FUNC_Native )
struct UcUIAction_OpenFileSelector_execSelectionDone_Parms
{
};

// Function APBUserInterface.cUIAction_OpenFileSelector.SelectionCanceled
// [0x00020400] ( FUNC_Native )
struct UcUIAction_OpenFileSelector_execSelectionCanceled_Parms
{
};

// Function APBUserInterface.cUIAction_OpenFileSelector.SelectionMade
// [0x00020400] ( FUNC_Native )
struct UcUIAction_OpenFileSelector_execSelectionMade_Parms
{
	struct FString                                     sSelectedPath;                                    		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function APBUserInterface.cUIAction_Soc_AddFriend.OnAddCompleted
// [0x00020400] ( FUNC_Native )
struct UcUIAction_Soc_AddFriend_execOnAddCompleted_Parms
{
	int                                                Error;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_Soc_AddIgnore.OnAddCompleted
// [0x00020400] ( FUNC_Native )
struct UcUIAction_Soc_AddIgnore_execOnAddCompleted_Parms
{
	int                                                Error;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_Soc_SendGroupInvite.OnInviteSendFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_Soc_SendGroupInvite_execOnInviteSendFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_Soc_SendGroupInvite.OnInviteSent
// [0x00020400] ( FUNC_Native )
struct UcUIAction_Soc_SendGroupInvite_execOnInviteSent_Parms
{
};

// Function APBUserInterface.cUIAction_Soc_SendTeamInvite.OnSendCompleted
// [0x00020400] ( FUNC_Native )
struct UcUIAction_Soc_SendTeamInvite_execOnSendCompleted_Parms
{
	int                                                Error;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_StreamLevel.IsValidUISequenceObject
// [0x00020802] ( FUNC_Event )
struct UcUIAction_StreamLevel_eventIsValidUISequenceObject_Parms
{
	class UUIScreenObject*                             TargetObject;                                     		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIAction_WorldEnter.OnWorldEnterFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_WorldEnter_execOnWorldEnterFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_WorldEnter.OnWorldEnterSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_WorldEnter_execOnWorldEnterSuccess_Parms
{
};

// Function APBUserInterface.cUIAction_WorldQueueCancel.OnWorldQueueCancelFailed
// [0x00020400] ( FUNC_Native )
struct UcUIAction_WorldQueueCancel_execOnWorldQueueCancelFailed_Parms
{
	int                                                nError;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIAction_WorldQueueCancel.OnWorldQueueCancelSuccess
// [0x00020400] ( FUNC_Native )
struct UcUIAction_WorldQueueCancel_execOnWorldQueueCancelSuccess_Parms
{
};

// Function APBUserInterface.cUIButton.OnSetImage
// [0x00020002] 
struct UcUIButton_execOnSetImage_Parms
{
	class UcUIAction_SetImage*                         Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIButton.SetSecondaryImage
// [0x00020003] ( FUNC_Final )
struct UcUIButton_execSetSecondaryImage_Parms
{
	class USurface*                                    NewImage;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIButton.SaveSubscriberValue
// [0x00420400] ( FUNC_Native )
struct UcUIButton_execSaveSubscriberValue_Parms
{
	TArray< class UUIDataStore* >                      out_BoundDataStores;                              		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                BindingIndex;                                     		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIButton.ClearBoundDataStores
// [0x00020400] ( FUNC_Native )
struct UcUIButton_execClearBoundDataStores_Parms
{
};

// Function APBUserInterface.cUIButton.GetBoundDataStores
// [0x00420400] ( FUNC_Native )
struct UcUIButton_execGetBoundDataStores_Parms
{
	TArray< class UUIDataStore* >                      out_BoundDataStores;                              		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function APBUserInterface.cUIButton.NotifyDataStoreValueUpdated
// [0x00020400] ( FUNC_Native )
struct UcUIButton_execNotifyDataStoreValueUpdated_Parms
{
	class UUIDataStore*                                SourceDataStore;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bValuesInvalidated : 1;                           		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FName                                       PropertyTag;                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UUIDataProvider*                             SourceProvider;                                   		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ArrayIndex;                                       		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIButton.RefreshSubscriberValue
// [0x00020400] ( FUNC_Native )
struct UcUIButton_execRefreshSubscriberValue_Parms
{
	int                                                BindingIndex;                                     		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIButton.GetDataStoreBinding
// [0x00020400] ( FUNC_Native )
struct UcUIButton_execGetDataStoreBinding_Parms
{
	int                                                BindingIndex;                                     		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function APBUserInterface.cUIButton.SetDataStoreBinding
// [0x00020400] ( FUNC_Native )
struct UcUIButton_execSetDataStoreBinding_Parms
{
	struct FString                                     MarkupText;                                       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                BindingIndex;                                     		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function APBUserInterface.cUIThumbnailList.OnChangeThumbnailListPage
// [0x00020002] 
struct UcUIThumbnailList_execOnChangeThumbnailListPage_Parms
{
	class UcUIAction_ChangeThumbnailListPage*          Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIThumbnailList.OnSetListIndex
// [0x00080003] ( FUNC_Final )
struct UcUIThumbnailList_execOnSetListIndex_Parms
{
	class UUIAction_SetListIndex*                      Action;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             OutputLinkIndex;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function APBUserInterface.cUIThumbnailList.SelectItem
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execSelectItem_Parms
{
	int                                                nIndex;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.GetInfoTextHeight
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execGetInfoTextHeight_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.GetImageHeight
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execGetImageHeight_Parms
{
	unsigned long                                      bIncludeText : 1;                                 		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.GetImageWidth
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execGetImageWidth_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.GetNumItems
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execGetNumItems_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.GetNumVisibleItems
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execGetNumVisibleItems_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.ChangePage
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execChangePage_Parms
{
	int                                                nDelta;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIThumbnailList.GetCurrentItem
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execGetCurrentItem_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.GetCurrentPage
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execGetCurrentPage_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.GetNumPages
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execGetNumPages_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.GetNumRows
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execGetNumRows_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.GetNumCols
// [0x00020400] ( FUNC_Native )
struct UcUIThumbnailList_execGetNumCols_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.OnScrollBarSpaceClicked
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UcUIThumbnailList_execOnScrollBarSpaceClicked_Parms
{
	class UUIScrollbar*                                Sender;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              PositionPerc;                                     		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                PlayerIndex;                                      		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIThumbnailList.OnScrollBarMoved
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UcUIThumbnailList_execOnScrollBarMoved_Parms
{
	class UUIScrollbar*                                Sender;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              PositionChange;                                   		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bPositionMaxed : 1;                               		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.SaveSubscriberValue
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UcUIThumbnailList_execSaveSubscriberValue_Parms
{
	TArray< class UUIDataStore* >                      out_BoundDataStores;                              		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                BindingIndex;                                     		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.ClearBoundDataStores
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UcUIThumbnailList_execClearBoundDataStores_Parms
{
};

// Function APBUserInterface.cUIThumbnailList.GetBoundDataStores
// [0x00420401] ( FUNC_Final | FUNC_Native )
struct UcUIThumbnailList_execGetBoundDataStores_Parms
{
	TArray< class UUIDataStore* >                      out_BoundDataStores;                              		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function APBUserInterface.cUIThumbnailList.NotifyDataStoreValueUpdated
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UcUIThumbnailList_execNotifyDataStoreValueUpdated_Parms
{
	class UUIDataStore*                                SourceDataStore;                                  		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bValuesInvalidated : 1;                           		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	struct FName                                       PropertyTag;                                      		// 0x0008 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	class UUIDataProvider*                             SourceProvider;                                   		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ArrayIndex;                                       		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function APBUserInterface.cUIThumbnailList.RefreshSubscriberValue
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UcUIThumbnailList_execRefreshSubscriberValue_Parms
{
	int                                                BindingIndex;                                     		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIThumbnailList.GetDataStoreBinding
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UcUIThumbnailList_execGetDataStoreBinding_Parms
{
	int                                                BindingIndex;                                     		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function APBUserInterface.cUIThumbnailList.SetDataStoreBinding
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct UcUIThumbnailList_execSetDataStoreBinding_Parms
{
	struct FString                                     MarkupText;                                       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                BindingIndex;                                     		// 0x000C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function APBUserInterface.cUICond_DoShowGameFlowScene.GetObjClassVersion
// [0x00022802] ( FUNC_Event )
struct UcUICond_DoShowGameFlowScene_eventGetObjClassVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.PreviewMissionStageDisable
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execPreviewMissionStageDisable_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.PreviewMissionStage
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execPreviewMissionStage_Parms
{
	struct FString                                     sMissionTemplate;                                 		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                nStage;                                           		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bOpposition : 1;                                  		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	struct FString                                     sFaction;                                         		// 0x0014 (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.TiledScreenShot
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execTiledScreenShot_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ScreenShot
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execScreenShot_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ChangeLanguage
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execChangeLanguage_Parms
{
	struct FString                                     sNewLanguage;                                     		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function APBUserInterface.cUIConsoleCommands.ResetPopupCounters
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execResetPopupCounters_Parms
{
};

// Function APBUserInterface.cUIConsoleCommands.TogglePopupDialogTool
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execTogglePopupDialogTool_Parms
{
};

// Function APBUserInterface.cUIConsoleCommands.TogglePopupCues
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execTogglePopupCues_Parms
{
};

// Function APBUserInterface.cUIConsoleCommands.ToggleTooltipTool
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleTooltipTool_Parms
{
};

// Function APBUserInterface.cUIConsoleCommands.OpenAPBSupportPage
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execOpenAPBSupportPage_Parms
{
	struct FString                                     sSDDURLTag;                                       		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bStackOnExistingScenes : 1;                       		// 0x000C (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.OpenWebBrowser
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execOpenWebBrowser_Parms
{
	struct FString                                     sURL;                                             		// 0x0000 (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sWebBrowser_SceneRef;                             		// 0x000C (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bStackOnExistingScenes : 1;                       		// 0x0018 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.CloseContactUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execCloseContactUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.OpenTestContactUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execOpenTestContactUI_Parms
{
	struct FString                                     sUIType;                                          		// 0x0000 (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.OpenContactUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execOpenContactUI_Parms
{
	struct FString                                     sContact;                                         		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     sContactRole;                                     		// 0x000C (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ToggleMusicPlaybackUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleMusicPlaybackUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.OpenViewUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execOpenViewUI_Parms
{
	struct FString                                     sInventoryItemType;                               		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ToggleOptionsUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleOptionsUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ToggleReportBugUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleReportBugUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.FlushMarketplaceCache
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execFlushMarketplaceCache_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.Editor_OpenMarketplaceUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execEditor_OpenMarketplaceUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ToggleMarketplaceUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleMarketplaceUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.FlushMailCache
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execFlushMailCache_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ToggleMailUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleMailUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ToggleTeamMgmtUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleTeamMgmtUI_Parms
{
	unsigned long                                      bForce : 1;                                       		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.InternalToggleInventoryUI
// [0x00020400] ( FUNC_Native )
struct UcUIConsoleCommands_execInternalToggleInventoryUI_Parms
{
};

// Function APBUserInterface.cUIConsoleCommands.ToggleDeploymentInventoryUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleDeploymentInventoryUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ToggleStorageInventoryUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleStorageInventoryUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ToggleSocialUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleSocialUI_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ToggleScoreboard
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleScoreboard_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ToggleMissionSummary
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleMissionSummary_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.CloseMissionSummary
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execCloseMissionSummary_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.OpenMissionSummary
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execOpenMissionSummary_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ToggleMissionJustification
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execToggleMissionJustification_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.CrimeEventAlertUI
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execCrimeEventAlertUI_Parms
{
	unsigned long                                      bShow : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.InGameQuestionDeclined
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execInGameQuestionDeclined_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.InGameQuestionAccepted
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execInGameQuestionAccepted_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.AddInGameQuestion
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execAddInGameQuestion_Parms
{
	struct FString                                     sText;                                            		// 0x0000 (0x000C) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.InvertMouse
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execInvertMouse_Parms
{
	unsigned long                                      bInvert : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function APBUserInterface.cUIConsoleCommands.ForceWorldsOffline
// [0x00020600] ( FUNC_Exec | FUNC_Native )
struct UcUIConsoleCommands_execForceWorldsOffline_Parms
{
