/*
#############################################################################################
# All Points Bulletin Reloaded (1.6) SDK
# Generated with TheFeckless UE3 SDK Generator v1.2_Beta-Rev.39
# ========================================================================================= #
# File: UnrealEd_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net	
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_AUTOEXPAND_VALUE                                   0

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum UnrealEd.ThumbnailManager.EThumbnailPrimType
/*enum EThumbnailPrimType
{
	TPT_None                                           = 0,
	TPT_Sphere                                         = 1,
	TPT_Cube                                           = 2,
	TPT_Plane                                          = 3,
	TPT_Cylinder                                       = 4,
	TPT_MAX                                            = 5
};*/

// Enum UnrealEd.ThumbnailManager.EThumbnailBackgroundType
/*enum EThumbnailBackgroundType
{
	TBT_None                                           = 0,
	TBT_DefaultBackground                              = 1,
	TBT_SolidBackground                                = 2,
	TBT_MAX                                            = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class UnrealEd.AnimNodeEditInfo
// 0x0004 (0x0044 - 0x0040)
class UAnimNodeEditInfo : public UObject
{
public:
	class UClass*                                      AnimNodeClass;                                    		// 0x0040 (0x0004) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.AnimNodeEditInfo" );

		return pClassPointer;
	};

};

UClass* UAnimNodeEditInfo::pClassPointer = NULL;

// Class UnrealEd.AnimNodeEditInfo_AimOffset
// 0x0010 (0x0054 - 0x0044)
class UAnimNodeEditInfo_AimOffset : public UAnimNodeEditInfo
{
public:
	struct FPointer                                    VfTable_cAnimAimOffsetEditorInterface;            		// 0x0044 (0x0004) [0x0000000000801002]              ( CPF_Const | CPF_Native | CPF_NoExport )
	struct FPointer                                    EditWindow;                                       		// 0x0048 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	struct FPointer                                    AnimTreeEditor;                                   		// 0x004C (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	class UAnimNodeAimOffset*                          EditNode;                                         		// 0x0050 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.AnimNodeEditInfo_AimOffset" );

		return pClassPointer;
	};

};

UClass* UAnimNodeEditInfo_AimOffset::pClassPointer = NULL;

// Class UnrealEd.ThumbnailLabelRenderer
// 0x0000 (0x0040 - 0x0040)
class UThumbnailLabelRenderer : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.ThumbnailLabelRenderer" );

		return pClassPointer;
	};

};

UClass* UThumbnailLabelRenderer::pClassPointer = NULL;

// Class UnrealEd.AnimSetLabelRenderer
// 0x0000 (0x0040 - 0x0040)
class UAnimSetLabelRenderer : public UThumbnailLabelRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.AnimSetLabelRenderer" );

		return pClassPointer;
	};

};

UClass* UAnimSetLabelRenderer::pClassPointer = NULL;

// Class UnrealEd.AnimTreeEdSkelComponent
// 0x0004 (0x04AC - 0x04A8)
class UAnimTreeEdSkelComponent : public USkeletalMeshComponent
{
public:
	struct FPointer                                    AnimTreeEdPtr;                                    		// 0x04A8 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.AnimTreeEdSkelComponent" );

		return pClassPointer;
	};

};

UClass* UAnimTreeEdSkelComponent::pClassPointer = NULL;

// Class UnrealEd.AnimTreeLabelRenderer
// 0x0000 (0x0040 - 0x0040)
class UAnimTreeLabelRenderer : public UThumbnailLabelRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.AnimTreeLabelRenderer" );

		return pClassPointer;
	};

};

UClass* UAnimTreeLabelRenderer::pClassPointer = NULL;

// Class UnrealEd.ThumbnailRenderer
// 0x0000 (0x0040 - 0x0040)
class UThumbnailRenderer : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.ThumbnailRenderer" );

		return pClassPointer;
	};

};

UClass* UThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.IconThumbnailRenderer
// 0x0010 (0x0050 - 0x0040)
class UIconThumbnailRenderer : public UThumbnailRenderer
{
public:
	struct FString                                     IconName;                                         		// 0x0040 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UTexture2D*                                  Icon;                                             		// 0x004C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.IconThumbnailRenderer" );

		return pClassPointer;
	};

};

UClass* UIconThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.ArchetypeThumbnailRenderer
// 0x0000 (0x0050 - 0x0050)
class UArchetypeThumbnailRenderer : public UIconThumbnailRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.ArchetypeThumbnailRenderer" );

		return pClassPointer;
	};

};

UClass* UArchetypeThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.ASVSkelComponent
// 0x000C (0x04B4 - 0x04A8)
class UASVSkelComponent : public USkeletalMeshComponent
{
public:
	struct FPointer                                    AnimSetViewerPtr;                                 		// 0x04A8 (0x0004) [0x0000000000001002]              ( CPF_Const | CPF_Native )
	unsigned long                                      bRenderRawSkeleton : 1;                           		// 0x04AC (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bShowSoftBodyTetra : 1;                           		// 0x04AC (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bDrawMesh : 1;                                    		// 0x04AC (0x0004) [0x0000000000000000] [0x00000004] 
	struct FColor                                      BoneColor;                                        		// 0x04B0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.ASVSkelComponent" );

		return pClassPointer;
	};

};

UClass* UASVSkelComponent::pClassPointer = NULL;

// Class UnrealEd.BrowserManager
// 0x0024 (0x0064 - 0x0040)
class UBrowserManager : public UObject
{
public:
	TArray< struct FBrowserPaneInfo >                  BrowserPanes;                                     		// 0x0040 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	unsigned long                                      bHasCreatedPanes : 1;                             		// 0x004C (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                LastSelectedPaneID;                               		// 0x0050 (0x0004) [0x0000000000004000]              ( CPF_Config )
	struct FPointer                                    DockingContainerPtr;                              		// 0x0054 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	struct FPointer                                    FloatingWindowsArrayPtr;                          		// 0x0058 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	struct FPointer                                    BrowserMenuPtr;                                   		// 0x005C (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	class UUISceneManager*                             UISceneManager;                                   		// 0x0060 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.BrowserManager" );

		return pClassPointer;
	};

};

UClass* UBrowserManager::pClassPointer = NULL;

// Class UnrealEd.CascadeOptions
// 0x00CC (0x010C - 0x0040)
class UCascadeOptions : public UObject
{
public:
	unsigned long                                      bShowModuleDump : 1;                              		// 0x0040 (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
	unsigned long                                      bUseSubMenus : 1;                                 		// 0x0040 (0x0004) [0x0000000000004001] [0x00000002] ( CPF_Edit | CPF_Config )
	unsigned long                                      bUseSpaceBarReset : 1;                            		// 0x0040 (0x0004) [0x0000000000004001] [0x00000004] ( CPF_Edit | CPF_Config )
	unsigned long                                      bUseSpaceBarResetInLevel : 1;                     		// 0x0040 (0x0004) [0x0000000000004001] [0x00000008] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowGrid : 1;                                    		// 0x0040 (0x0004) [0x0000000000004001] [0x00000010] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowParticleCounts : 1;                          		// 0x0040 (0x0004) [0x0000000000004001] [0x00000020] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowParticleEvents : 1;                          		// 0x0040 (0x0004) [0x0000000000004001] [0x00000040] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowParticleTimes : 1;                           		// 0x0040 (0x0004) [0x0000000000004001] [0x00000080] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowParticleDistance : 1;                        		// 0x0040 (0x0004) [0x0000000000004001] [0x00000100] ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowFloor : 1;                                   		// 0x0040 (0x0004) [0x0000000000004001] [0x00000200] ( CPF_Edit | CPF_Config )
	unsigned long                                      bUseSlimCascadeDraw : 1;                          		// 0x0040 (0x0004) [0x0000000000004001] [0x00000400] ( CPF_Edit | CPF_Config )
	unsigned long                                      bCenterCascadeModuleText : 1;                     		// 0x0040 (0x0004) [0x0000000000004001] [0x00000800] ( CPF_Edit | CPF_Config )
	struct FColor                                      BackgroundColor;                                  		// 0x0044 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      Empty_Background;                                 		// 0x0048 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      Emitter_Background;                               		// 0x004C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      Emitter_Unselected;                               		// 0x0050 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      Emitter_Selected;                                 		// 0x0054 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_General_Unselected;                   		// 0x0058 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_General_Selected;                     		// 0x005C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_TypeData_Unselected;                  		// 0x0060 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_TypeData_Selected;                    		// 0x0064 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Beam_Unselected;                      		// 0x0068 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Beam_Selected;                        		// 0x006C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Trail_Unselected;                     		// 0x0070 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Trail_Selected;                       		// 0x0074 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Spawn_Unselected;                     		// 0x0078 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Spawn_Selected;                       		// 0x007C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Required_Unselected;                  		// 0x0080 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Required_Selected;                    		// 0x0084 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Event_Unselected;                     		// 0x0088 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      ModuleColor_Event_Selected;                       		// 0x008C (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      GridColor_Hi;                                     		// 0x0090 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FColor                                      GridColor_Low;                                    		// 0x0094 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              GridPerspectiveSize;                              		// 0x0098 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FString                                     FloorMesh;                                        		// 0x009C (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	struct FVector                                     FloorPosition;                                    		// 0x00A8 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FRotator                                    FloorRotation;                                    		// 0x00B4 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              FloorScale;                                       		// 0x00C0 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FVector                                     FloorScale3D;                                     		// 0x00C4 (0x000C) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FString                                     PostProcessChainName;                             		// 0x00D0 (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	int                                                ShowPPFlags;                                      		// 0x00DC (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                SlimCascadeDrawHeight;                            		// 0x00E0 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	int                                                Cascade_MouseMoveThreshold;                       		// 0x00E4 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	TArray< struct FModuleMenuMapper >                 ModuleMenu_TypeDataToBaseModuleRejections;        		// 0x00E8 (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	TArray< struct FModuleMenuMapper >                 ModuleMenu_TypeDataToSpecificModuleRejections;    		// 0x00F4 (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )
	TArray< struct FString >                           ModuleMenu_ModuleRejections;                      		// 0x0100 (0x000C) [0x0000000000404001]              ( CPF_Edit | CPF_Config | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.CascadeOptions" );

		return pClassPointer;
	};

};

UClass* UCascadeOptions::pClassPointer = NULL;

// Class UnrealEd.CascadePreviewComponent
// 0x0004 (0x01DC - 0x01D8)
class UCascadePreviewComponent : public UPrimitiveComponent
{
public:
	struct FPointer                                    CascadePtr;                                       		// 0x01D8 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.CascadePreviewComponent" );

		return pClassPointer;
	};

};

UClass* UCascadePreviewComponent::pClassPointer = NULL;

// Class UnrealEd.CurveEdOptions
// 0x0078 (0x00B8 - 0x0040)
class UCurveEdOptions : public UObject
{
public:
	float                                              MinViewRange;                                     		// 0x0040 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	float                                              MaxViewRange;                                     		// 0x0044 (0x0004) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                BackgroundColor;                                  		// 0x0048 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                LabelColor;                                       		// 0x0058 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                SelectedLabelColor;                               		// 0x0068 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                GridColor;                                        		// 0x0078 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                GridTextColor;                                    		// 0x0088 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                LabelBlockBkgColor;                               		// 0x0098 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                SelectedKeyColor;                                 		// 0x00A8 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.CurveEdOptions" );

		return pClassPointer;
	};

};

UClass* UCurveEdOptions::pClassPointer = NULL;

// Class UnrealEd.CurveEdPresetBase
// 0x0000 (0x0040 - 0x0040)
class UCurveEdPresetBase : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.CurveEdPresetBase" );

		return pClassPointer;
	};

	bool eventGenerateCurveData ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool eventFetchRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool eventCheckAreSettingsValid ( unsigned long bIsSaving );
	void eventFetchDisplayName ( struct FString* OutName );
	bool GenerateCurve ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool GetRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool AreSettingsValid ( unsigned long bIsSaving );
	struct FString GetDisplayName ( );
};

UClass* UCurveEdPresetBase::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_CosWave
// 0x000C (0x004C - 0x0040)
class UCurveEdPreset_CosWave : public UCurveEdPresetBase
{
public:
	float                                              Frequency;                                        		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Scale;                                            		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Offset;                                           		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.CurveEdPreset_CosWave" );

		return pClassPointer;
	};

	bool GenerateCurve ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool GetRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool AreSettingsValid ( unsigned long bIsSaving );
	struct FString GetDisplayName ( );
};

UClass* UCurveEdPreset_CosWave::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_LinearDecay
// 0x0010 (0x0050 - 0x0040)
class UCurveEdPreset_LinearDecay : public UCurveEdPresetBase
{
public:
	float                                              StartDecay;                                       		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              StartValue;                                       		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              EndDecay;                                         		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              EndValue;                                         		// 0x004C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.CurveEdPreset_LinearDecay" );

		return pClassPointer;
	};

	bool GenerateCurve ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool GetRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool AreSettingsValid ( unsigned long bIsSaving );
	struct FString GetDisplayName ( );
};

UClass* UCurveEdPreset_LinearDecay::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_Nothing
// 0x0000 (0x0040 - 0x0040)
class UCurveEdPreset_Nothing : public UCurveEdPresetBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.CurveEdPreset_Nothing" );

		return pClassPointer;
	};

	struct FString GetDisplayName ( );
};

UClass* UCurveEdPreset_Nothing::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_SineWave
// 0x000C (0x004C - 0x0040)
class UCurveEdPreset_SineWave : public UCurveEdPresetBase
{
public:
	float                                              Frequency;                                        		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Scale;                                            		// 0x0044 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Offset;                                           		// 0x0048 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.CurveEdPreset_SineWave" );

		return pClassPointer;
	};

	bool GenerateCurve ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool GetRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool AreSettingsValid ( unsigned long bIsSaving );
	struct FString GetDisplayName ( );
};

UClass* UCurveEdPreset_SineWave::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_UserSet
// 0x0004 (0x0044 - 0x0040)
class UCurveEdPreset_UserSet : public UCurveEdPresetBase
{
public:
	class UCurveEdPresetCurve*                         UserCurve;                                        		// 0x0040 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.CurveEdPreset_UserSet" );

		return pClassPointer;
	};

	bool SaveUserSetPointFile ( );
	bool LoadUserSetPointFile ( );
	bool SetCurve ( TArray< struct FPresetGeneratedPoint > GeneratedPoints );
	bool GenerateCurve ( TArray< float >* RequiredKeyInTimes, TArray< struct FPresetGeneratedPoint >* GeneratedPoints );
	bool GetRequiredKeyInTimes ( TArray< float >* RequiredKeyInTimes );
	bool AreSettingsValid ( unsigned long bIsSaving );
	struct FString GetDisplayName ( );
};

UClass* UCurveEdPreset_UserSet::pClassPointer = NULL;

// Class UnrealEd.PropertyInputProxy
// 0x0010 (0x0050 - 0x0040)
class UPropertyInputProxy : public UObject
{
public:
	unsigned char                                      UnknownData00[ 0x10 ];                            		// 0x0040 (0x0010) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.PropertyInputProxy" );

		return pClassPointer;
	};

};

UClass* UPropertyInputProxy::pClassPointer = NULL;

// Class UnrealEd.CustomInputProxy_Base
// 0x0004 (0x0054 - 0x0050)
class UCustomInputProxy_Base : public UPropertyInputProxy
{
public:
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x0050 (0x0004) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.CustomInputProxy_Base" );

		return pClassPointer;
	};

};

UClass* UCustomInputProxy_Base::pClassPointer = NULL;

// Class UnrealEd.DefaultSizedThumbnailRenderer
// 0x0008 (0x0048 - 0x0040)
class UDefaultSizedThumbnailRenderer : public UThumbnailRenderer
{
public:
	int                                                DefaultSizeX;                                     		// 0x0040 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                DefaultSizeY;                                     		// 0x0044 (0x0004) [0x0000000000004000]              ( CPF_Config )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.DefaultSizedThumbnailRenderer" );

		return pClassPointer;
	};

};

UClass* UDefaultSizedThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.EditorUISceneClient
// 0x0014 (0x010C - 0x00F8)
class UEditorUISceneClient : public UUISceneClient
{
public:
	class UUIScene*                                    Scene;                                            		// 0x00F8 (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	class UUISceneManager*                             SceneManager;                                     		// 0x00FC (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )
	struct FPointer                                    SceneWindow;                                      		// 0x0100 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	struct FPointer                                    ClientCanvasScene;                                		// 0x0104 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )
	unsigned long                                      bIsUIPrimitiveSceneInitialized : 1;               		// 0x0108 (0x0004) [0x0000000000002002] [0x00000001] ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.EditorUISceneClient" );

		return pClassPointer;
	};

	void ShowDockingStacks ( );
};

UClass* UEditorUISceneClient::pClassPointer = NULL;

// Class UnrealEd.FaceFXStudioSkelComponent
// 0x0004 (0x04AC - 0x04A8)
class UFaceFXStudioSkelComponent : public USkeletalMeshComponent
{
public:
	struct FPointer                                    RenderWidgetUE3Ptr;                               		// 0x04A8 (0x0004) [0x0000000000003002]              ( CPF_Const | CPF_Native | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.FaceFXStudioSkelComponent" );

		return pClassPointer;
	};

};

UClass* UFaceFXStudioSkelComponent::pClassPointer = NULL;

// Class UnrealEd.TextureThumbnailRenderer
// 0x0000 (0x0040 - 0x0040)
class UTextureThumbnailRenderer : public UThumbnailRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.TextureThumbnailRenderer" );

		return pClassPointer;
	};

};

UClass* UTextureThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.FontThumbnailRenderer
// 0x0000 (0x0040 - 0x0040)
class UFontThumbnailRenderer : public UTextureThumbnailRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.FontThumbnailRenderer" );

		return pClassPointer;
	};

};

UClass* UFontThumbnailRenderer::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType
// 0x001C (0x005C - 0x0040)
class UGenericBrowserType : public UObject
{
public:
	struct FString                                     Description;                                      		// 0x0040 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FGenericBrowserTypeInfo >           SupportInfo;                                      		// 0x004C (0x000C) [0x0000000000001000]              ( CPF_Native )
	struct FColor                                      BorderColor;                                      		// 0x0058 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Custom
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_Custom : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_Custom" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_Custom::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_All
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_All : public UGenericBrowserType_Custom
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_All" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_All::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Animation
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_Animation : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_Animation" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_Animation::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_AnimTree
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_AnimTree : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_AnimTree" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_AnimTree::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Archetype
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_Archetype : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_Archetype" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_Archetype::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_CameraAnim
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_CameraAnim : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_CameraAnim" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_CameraAnim::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_CurveEdPresetCurve
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_CurveEdPresetCurve : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_CurveEdPresetCurve" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_CurveEdPresetCurve::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_DecalMaterial
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_DecalMaterial : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_DecalMaterial" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_DecalMaterial::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_FaceFXAnimSet
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_FaceFXAnimSet : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_FaceFXAnimSet" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_FaceFXAnimSet::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_FaceFXAsset
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_FaceFXAsset : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_FaceFXAsset" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_FaceFXAsset::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Font
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_Font : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_Font" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_Font::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_LensFlare
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_LensFlare : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_LensFlare" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_LensFlare::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Material
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_Material : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_Material" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_Material::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_MaterialInstanceConstant
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_MaterialInstanceConstant : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_MaterialInstanceConstant" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_MaterialInstanceConstant::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_MaterialInstanceTimeVarying
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_MaterialInstanceTimeVarying : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_MaterialInstanceTimeVarying" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_MaterialInstanceTimeVarying::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_MaterialLackingPhysMat
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_MaterialLackingPhysMat : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_MaterialLackingPhysMat" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_MaterialLackingPhysMat::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_MorphTargetSet
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_MorphTargetSet : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_MorphTargetSet" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_MorphTargetSet::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_MorphWeightSequence
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_MorphWeightSequence : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_MorphWeightSequence" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_MorphWeightSequence::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_ParticleSystem
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_ParticleSystem : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_ParticleSystem" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_ParticleSystem::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_PhysicalMaterial
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_PhysicalMaterial : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_PhysicalMaterial" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_PhysicalMaterial::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_PhysicsAsset
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_PhysicsAsset : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_PhysicsAsset" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_PhysicsAsset::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_PhysXParticleSystem
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_PhysXParticleSystem : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_PhysXParticleSystem" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_PhysXParticleSystem::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_PostProcess
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_PostProcess : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_PostProcess" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_PostProcess::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Prefab
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_Prefab : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_Prefab" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_Prefab::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Texture
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_Texture : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_Texture" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_Texture::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_RenderTexture
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_RenderTexture : public UGenericBrowserType_Texture
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_RenderTexture" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_RenderTexture::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Sequence
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_Sequence : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_Sequence" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_Sequence::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SkeletalMesh
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_SkeletalMesh : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_SkeletalMesh" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_SkeletalMesh::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_Sounds
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_Sounds : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_Sounds" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_Sounds::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SoundCue
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_SoundCue : public UGenericBrowserType_Sounds
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_SoundCue" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_SoundCue::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SoundWave
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_SoundWave : public UGenericBrowserType_Sounds
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_SoundWave" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_SoundWave::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SpeechRecognition
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_SpeechRecognition : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_SpeechRecognition" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_SpeechRecognition::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_SpeedTree
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_SpeedTree : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_SpeedTree" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_SpeedTree::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_StaticMesh
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_StaticMesh : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_StaticMesh" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_StaticMesh::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_TerrainLayer
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_TerrainLayer : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_TerrainLayer" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_TerrainLayer::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_TerrainMaterial
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_TerrainMaterial : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_TerrainMaterial" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_TerrainMaterial::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_TextureWithAlpha
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_TextureWithAlpha : public UGenericBrowserType_Texture
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_TextureWithAlpha" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_TextureWithAlpha::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_UIArchetype
// 0x0004 (0x0060 - 0x005C)
class UGenericBrowserType_UIArchetype : public UGenericBrowserType_Archetype
{
public:
	class UUISceneManager*                             SceneManager;                                     		// 0x005C (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_UIArchetype" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_UIArchetype::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_UIScene
// 0x0004 (0x0060 - 0x005C)
class UGenericBrowserType_UIScene : public UGenericBrowserType
{
public:
	class UUISceneManager*                             SceneManager;                                     		// 0x005C (0x0004) [0x0000000000002002]              ( CPF_Const | CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_UIScene" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_UIScene::pClassPointer = NULL;

// Class UnrealEd.GenericBrowserType_UISkin
// 0x0000 (0x005C - 0x005C)
class UGenericBrowserType_UISkin : public UGenericBrowserType
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericBrowserType_UISkin" );

		return pClassPointer;
	};

};

UClass* UGenericBrowserType_UISkin::pClassPointer = NULL;

// Class UnrealEd.GenericThumbnailLabelRenderer
// 0x0000 (0x0040 - 0x0040)
class UGenericThumbnailLabelRenderer : public UThumbnailLabelRenderer
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.GenericThumbnailLabelRenderer" );

		return pClassPointer;
	};

};

UClass* UGenericThumbnailLabelRenderer::pClassPointer = NULL;

// Class UnrealEd.InterpEdOptions
// 0x000C (0x004C - 0x0040)
class UInterpEdOptions : public UObject
{
public:
	TArray< struct FInterpEdSelKey >                   SelectedKeys;                                     		// 0x0040 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.InterpEdOptions" );

		return pClassPointer;
	};

};

UClass* UInterpEdOptions::pClassPointer = NULL;

// Class UnrealEd.InterpTrackHelper
// 0x0000 (0x0040 - 0x0040)
class UInterpTrackHelper : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.InterpTrackHelper" );

		return pClassPointer;
	};

};

UClass* UInterpTrackHelper::pClassPointer = NULL;

// Class UnrealEd.InterpTrackAnimControlHelper
// 0x0000 (0x0040 - 0x0040)
class UInterpTrackAnimControlHelper : public UInterpTrackHelper
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.InterpTrackAnimControlHelper" );

		return pClassPointer;
	};

};

UClass* UInterpTrackAnimControlHelper::pClassPointer = NULL;

// Class UnrealEd.InterpTrackVectorPropHelper
// 0x0000 (0x0040 - 0x0040)
class UInterpTrackVectorPropHelper : public UInterpTrackHelper
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.InterpTrackVectorPropHelper" );

		return pClassPointer;
	};

};

UClass* UInterpTrackVectorPropHelper::pClassPointer = NULL;

// Class UnrealEd.InterpTrackColorPropHelper
// 0x0000 (0x0040 - 0x0040)
class UInterpTrackColorPropHelper : public UInterpTrackVectorPropHelper
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.InterpTrackColorPropHelper" );

		return pClassPointer;
	};

};

UClass* UInterpTrackColorPropHelper::pClassPointer = NULL;

// Class UnrealEd.InterpTrackDirectorHelper
// 0x0000 (0x0040 - 0x0040)
class UInterpTrackDirectorHelper : public UInterpTrackHelper
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.InterpTrackDirectorHelper" );

		return pClassPointer;
	};

};

UClass* UInterpTrackDirectorHelper::pClassPointer = NULL;

// Class UnrealEd.InterpTrackEventHelper
// 0x0000 (0x0040 - 0x0040)
class UInterpTrackEventHelper : public UInterpTrackHelper
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.InterpTrackEventHelper" );

		return pClassPointer;
	};

};

UClass* UInterpTrackEventHelper::pClassPointer = NULL;

// Class UnrealEd.InterpTrackFaceFXHelper
// 0x0000 (0x0040 - 0x0040)
class UInterpTrackFaceFXHelper : public UInterpTrackHelper
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.InterpTrackFaceFXHelper" );

		return pClassPointer;
	};

};

UClass* UInterpTrackFaceFXHelper::pClassPointer = NULL;

// Class UnrealEd.InterpTrackFloatPropHelper
// 0x0000 (0x0040 - 0x0040)
class UInterpTrackFloatPropHelper : public UInterpTrackHelper
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.InterpTrackFloatPropHelper" );

		return pClassPointer;
	};

};

UClass* UInterpTrackFloatPropHelper::pClassPointer = NULL;

// Class UnrealEd.InterpTrackSoundHelper
// 0x0000 (0x0040 - 0x0040)
class UInterpTrackSoundHelper : public UInterpTrackHelper
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.InterpTrackSoundHelper" );

		return pClassPointer;
	};

};

UClass* UInterpTrackSoundHelper::pClassPointer = NULL;

// Class UnrealEd.InterpTrackToggleHelper
// 0x0000 (0x0040 - 0x0040)
class UInterpTrackToggleHelper : public UInterpTrackHelper
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.InterpTrackToggleHelper" );

		return pClassPointer;
	};

};

UClass* UInterpTrackToggleHelper::pClassPointer = NULL;

// Class UnrealEd.KismetBindings
// 0x0018 (0x0058 - 0x0040)
class UKismetBindings : public UObject
{
public:
	TArray< struct FKismetKeyBind >                    Bindings;                                         		// 0x0040 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FKismetCommentPreset >              CommentPresets;                                   		// 0x004C (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = UObject::FindClass ( "Class UnrealEd.KismetBindings" );

		return pClassPointer;
	};

};

UClass* UKismetBindings::pClassPointer = NULL;

// Class UnrealEd.LensFlareEditorOptions
// 0x00A0 (0x00E0 - 0x0040)
class ULensFlareEditorOptions : public UObject
{
public:
	struct FLinearColor                                LFED_BackgroundColor;                             		// 0x0040 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                LFED_Empty_Background;                            		// 0x0050 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                LFED_Source_ElementEd_Background;                 		// 0x0060 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                LFED_Source_Unselected;                           		// 0x0070 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                LFED_Source_Selected;                             		// 0x0080 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                LFED_ElementEd_Background;                        		// 0x0090 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                LFED_Element_Unselected;                          		// 0x00A0 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	struct FLinearColor                                LFED_Element_Selected;                            		// 0x00B0 (0x0010) [0x0000000000004001]              ( CPF_Edit | CPF_Config )
	unsigned long                                      bShowGrid : 1;                                    		// 0x00C0 (0x0004) [0x0000000000004001] [0x00000001] ( CPF_Edit | CPF_Config )
