/*
#############################################################################################
# All Points Bulletin Reloaded (1.6) SDK
# Generated with TheFeckless UE3 SDK Generator v1.2_Beta-Rev.39
# ========================================================================================= #
# File: APBGame_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net	
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Script Structs
# ========================================================================================= #
*/

// ScriptStruct APBGame.APBGameInfo.DesignerConstant
// 0x0004
struct FDesignerConstant
{
	float                                              m_fValue;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.APBGameInfo.OpenWorldConstant
// 0x0008
struct FOpenWorldConstant
{
	unsigned char                                      m_eOpenWorldConstant;                             		// 0x0000 (0x0001) [0x0000000000000000]              
	float                                              m_fValue;                                         		// 0x0004 (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.APBStudio.TextureGenerationData
// 0x0020
struct FTextureGenerationData
{
	unsigned char                                      eBuildState;                                      		// 0x0000 (0x0001) [0x0000000000000000]              
	int                                                nStateIndex;                                      		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                nNumMipLevels;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
	class UcGolemRenderTarget*                         pRenderTarget;                                    		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned long                                      bNormalMap : 1;                                   		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	class UTexture2D*                                  pTexture;                                         		// 0x0014 (0x0004) [0x0000000000000000]              
	unsigned long                                      bIsDataValid : 1;                                 		// 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bGenerateMipLevels : 1;                           		// 0x0018 (0x0004) [0x0000000000000000] [0x00000002] 
	struct FPointer                                    Requester;                                        		// 0x001C (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.GolemobileBase.GolemobilePartType
// 0x0044
struct FGolemobilePartType
{
	struct FString                                     sName;                                            		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     sDisplayName;                                     		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bCommon : 1;                                      		// 0x0018 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	int                                                NumParts;                                         		// 0x001C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      eCategory;                                        		// 0x0020 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	int                                                DefaultPart;                                      		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      Optional : 1;                                     		// 0x0028 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      ColourCustomisable : 1;                           		// 0x0028 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	struct FName                                       sAttachToSocket;                                  		// 0x002C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  ComponentMask;                                    		// 0x0034 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< unsigned long >                            bExportToUI;                                      		// 0x0038 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct APBGame.GolemBase.GolemProjectionArea
// 0x0040
struct FGolemProjectionArea
{
	unsigned char                                      nID;                                              		// 0x0000 (0x0001) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	struct FString                                     Name;                                             		// 0x0004 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UTexture2D*                                  Mask;                                             		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     Bone;                                             		// 0x0014 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	float                                              fDefaultRadius;                                   		// 0x0020 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fDefaultHeight;                                   		// 0x0024 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     vBonePositionOffset;                              		// 0x0028 (0x000C) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     vBoneDirectionOffset;                             		// 0x0034 (0x000C) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct APBGame.GolemBase.GolemBaseHairType
// 0x0024
struct FGolemBaseHairType
{
	struct FString                                     Name;                                             		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UTexture2D*                                  BaseColourTexture;                                		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  BaseNormalMapTexture;                             		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  MeshColourTexture;                                		// 0x0014 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  MeshNormalMapTexture;                             		// 0x0018 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              SpecularExponent1;                                		// 0x001C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              SpecularExponent2;                                		// 0x0020 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct APBGame.GolemBase.GolemBaseHairShape
// 0x0050
struct FGolemBaseHairShape
{
	struct FString                                     Name;                                             		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class USkeletalMesh*                               SkeletalMesh;                                     		// 0x000C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UMorphTargetSet*                             BaseBodyMorph;                                    		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FString >                           BodyMorphGroupsToDisable;                         		// 0x0014 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class UAnimTree*                                   AnimTree;                                         		// 0x0020 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< class UAnimSet* >                          AnimSets;                                         		// 0x0024 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< class UMorphTargetSet* >                   MorphSets;                                        		// 0x0030 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FGolemBaseHairType >                Types;                                            		// 0x003C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bDisabled : 1;                                    		// 0x0048 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	int                                                Guid;                                             		// 0x004C (0x0004) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
};

// ScriptStruct APBGame.GolemobileBase.GolemobileLicensePlateData
// 0x0030
struct FGolemobileLicensePlateData
{
	struct FVector2D                                   BackDestTL;                                       		// 0x0000 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   BackDestBR;                                       		// 0x0008 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   BackSrcTL;                                        		// 0x0010 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   BackSrcBR;                                        		// 0x0018 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FLinearColor                                DigitColour;                                      		// 0x0020 (0x0010) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct APBGame.GolemBase.GolemProjectionPose
// 0x0014
struct FGolemProjectionPose
{
	struct FString                                     AnimSeqName;                                      		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bStaticPose : 1;                                  		// 0x000C (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	float                                              Time;                                             		// 0x0010 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct APBGame.GolemBase.GolemMakeUpData
// 0x0010
struct FGolemMakeUpData
{
	unsigned long                                      bGrayscale : 1;                                   		// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	class UTexture2D*                                  pTexture;                                         		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                nUIPriority;                                      		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                nOriginalIndex;                                   		// 0x000C (0x0004) [0x0000000000002000]              ( CPF_Transient )
};

// ScriptStruct APBGame.GolemBase.GolemScar
// 0x0018
struct FGolemScar
{
	class UTexture2D*                                  OldColourMap;                                     		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  NewColourMap;                                     		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  NormalMap;                                        		// 0x0008 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     LocalisedNameTag;                                 		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
};

// ScriptStruct APBGame.GolemBase.GolemBaseColourNormalMap
// 0x0008
struct FGolemBaseColourNormalMap
{
	class UTexture2D*                                  ColourMap;                                        		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture2D*                                  NormalMap;                                        		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct APBGame.GolemBase.GolemBaseSkinTone
// 0x0008
struct FGolemBaseSkinTone
{
	class UTexture2D*                                  ColourMap;                                        		// 0x0000 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Threshold;                                        		// 0x0004 (0x0004) [0x0000000000000001]              ( CPF_Edit )
};

// ScriptStruct APBGame.GolemBase.GolemBaseTextureBlock
// 0x0018
struct FGolemBaseTextureBlock
{
	int                                                nX;                                               		// 0x0000 (0x0004) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	int                                                nY;                                               		// 0x0004 (0x0004) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	float                                              fPriority;                                        		// 0x0008 (0x0004) [0x0000000000020001]              ( CPF_Edit | CPF_EditConst )
	TArray< int >                                      aSegments;                                        		// 0x000C (0x000C) [0x0000000000420001]              ( CPF_Edit | CPF_EditConst | CPF_NeedCtorLink )
};

// ScriptStruct APBGame.GolemBase.SegmentationDataLOD
// 0x0030
struct FSegmentationDataLOD
{
	TArray< struct FString >                           aSegmentNames;                                    		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      aSegmentMap;                                      		// 0x000C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      aSegmentPerFace;                                  		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      aChunkPerFace;                                    		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct APBGame.GolemBase.GolemPartExternalData
// 0x001C
struct FGolemPartExternalData
{
	struct FString                                     sName;                                            		// 0x0000 (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FString                                     sGolemPartName;                                   		// 0x000C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	unsigned long                                      bEnabled : 1;                                     		// 0x0018 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bLoaded : 1;                                      		// 0x0018 (0x0004) [0x0000000000002000] [0x00000002] ( CPF_Transient )
};

// ScriptStruct APBGame.cNPCVehicleBrain.NPCVehicleSpeed
// 0x001C
struct FNPCVehicleSpeed
{
	int                                                m_eNPCVehicleCategory;                            		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              m_fMinTopSpeedRatio;                              		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              m_fMaxTopSpeedRatio;                              		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              m_fMinAcceleration;                               		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              m_fMaxAcceleration;                               		// 0x0010 (0x0004) [0x0000000000000000]              
	float                                              m_fMinDeceleration;                               		// 0x0014 (0x0004) [0x0000000000000000]              
	float                                              m_fMaxDeceleration;                               		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.cAmmoDepotComponent.tResupplyOperation
// 0x0052
struct FtResupplyOperation
{
	float                                              m_fResupplyStartTime;                             		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              m_fLastUpdateTime;                                		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                m_nResupplyUnitSize;                              		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              m_fUnitResupplySeconds;                           		// 0x000C (0x0004) [0x0000000000000000]              
	class AcAPBPlayerController*                       m_pPC;                                            		// 0x0010 (0x0004) [0x0000000000000000]              
	class AcWeapon*                                    m_pWeapon;                                        		// 0x0014 (0x0004) [0x0000000000000000]              
	class UiAmmoConsumer*                              m_pAmmoConsumer;                                  		// 0x0018 (0x0008) [0x0000000000000000]              
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x001C (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class UiAmmoSupplier*                              m_pAmmoSupplier;                                  		// 0x0020 (0x0008) [0x0000000000000000]              
	unsigned char                                      UnknownData01[ 0x4 ];                             		// 0x0024 (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	class UiAmmoCarrier*                               m_pAmmoCarrier;                                   		// 0x0028 (0x0008) [0x0000000000000000]              
	unsigned char                                      UnknownData02[ 0x4 ];                             		// 0x002C (0x0004) FIX WRONG TYPE SIZE OF PREVIUS PROPERTY
	float                                              m_fAmmoResupplyRadius;                            		// 0x0030 (0x0004) [0x0000000000000000]              
	float                                              m_fProgress;                                      		// 0x0034 (0x0004) [0x0000000000000000]              
	int                                                m_nStartAmmoAmount;                               		// 0x0038 (0x0004) [0x0000000000000000]              
	int                                                m_nTotalAmmoSupplied;                             		// 0x003C (0x0004) [0x0000000000000000]              
	int                                                m_nTotalAmmoSuppliedFromStorage;                  		// 0x0040 (0x0004) [0x0000000000000000]              
	int                                                m_nTotalAmmoBought;                               		// 0x0044 (0x0004) [0x0000000000000000]              
	int                                                m_nTotalCost;                                     		// 0x0048 (0x0004) [0x0000000000000000]              
	float                                              m_fFractionalCost;                                		// 0x004C (0x0004) [0x0000000000000000]              
	unsigned char                                      m_eResupplyState;                                 		// 0x0050 (0x0001) [0x0000000000000000]              
	unsigned char                                      m_eResupplyTarget;                                		// 0x0051 (0x0001) [0x0000000000000000]              
};

// ScriptStruct APBGame.cAmmoDepotComponent.tPendingResupplyInfo
// 0x0010
struct FtPendingResupplyInfo
{
	class AcAPBPlayerController*                       m_pPC;                                            		// 0x0000 (0x0004) [0x0000000000000000]              
	TArray< unsigned char >                            m_aWeaponTypes;                                   		// 0x0004 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct APBGame.cAPBUsableComponent.UserData
// 0x0009
struct FUserData
{
	class AcAPBPlayerController*                       UserController;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              fDuration;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	unsigned char                                      eCurrentCSA;                                      		// 0x0008 (0x0001) [0x0000000000000000]              
};

// ScriptStruct APBGame.cAPBUsableComponent.IPData
// 0x0011
struct FIPData
{
	TArray< struct FUserData >                         aUsers;                                           		// 0x0000 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              fCachedProgress;                                  		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned char                                      eCachedCSA;                                       		// 0x0010 (0x0001) [0x0000000000000000]              
};

// ScriptStruct APBGame.cSDDVehicle.VehicleInteractionSequence
// 0x0014
struct FVehicleInteractionSequence
{
	int                                                m_eVehiclePlayerAnimationSet;                     		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_eVehicleInteractionAnimation;                   		// 0x0004 (0x0001) [0x0000000000000000]              
	struct FString                                     m_sSequenceName;                                  		// 0x0008 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
};

// ScriptStruct APBGame.cSDDVehicle.VehicleInteractionAnimation
// 0x0010
struct FVehicleInteractionAnimation
{
	unsigned char                                      m_eVehicleInteractionAnimation;                   		// 0x0000 (0x0001) [0x0000000000000000]              
	unsigned long                                      m_bMirror : 1;                                    		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bScaleRoot : 1;                                 		// 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      m_bStartAtOrigin : 1;                             		// 0x0004 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      m_bPauseAtEnd : 1;                                		// 0x0004 (0x0004) [0x0000000000000000] [0x00000008] 
	float                                              m_fBlendInTime;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              m_fBlendOutTime;                                  		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.cSDDVehicle.VehicleCritical
// 0x000C
struct FVehicleCritical
{
	int                                                m_eVehicleCritical;                               		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                m_eHUDMessage;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              m_fWeight;                                        		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.cSDDVehicle.GolemPart
// 0x002C
struct FGolemPart
{
	struct FString                                     m_sGolemPart;                                     		// 0x0000 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sUsername;                                      		// 0x000C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                m_eClass;                                         		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bStartup : 1;                                   		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                m_eClothingItemCategory;                          		// 0x0020 (0x0004) [0x0000000000000000]              
	int                                                m_nVersatility;                                   		// 0x0024 (0x0004) [0x0000000000000000]              
	int                                                m_nSecondaryKey;                                  		// 0x0028 (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.cSDDVehicle.GolemPartClass
// 0x000C
struct FGolemPartClass
{
	int                                                m_eGolemPartClass;                                		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bUseInClothingPreview : 1;                      		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                m_nSecondaryKey;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.cSDDVehicle.VehicleGear
// 0x0010
struct FVehicleGear
{
	unsigned char                                      m_eVehicleGear;                                   		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FString                                     m_sPackageImageRef;                               		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct APBGame.cSDDVehicle.VehicleAudioPartDefaults
// 0x0094
struct FVehicleAudioPartDefaults
{
	int                                                m_eVehicleAudioPartDefaults;                      		// 0x0000 (0x0004) [0x0000000000000000]              
	int                                                m_eDefaultEngine;                                 		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                m_eDefaultSiren;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                m_eDefaultHorn;                                   		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                m_eDefaultExhaust;                                		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                m_eDefaultAmp;                                    		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                m_eDefaultSpeaker;                                		// 0x0018 (0x0004) [0x0000000000000000]              
	float                                              m_fWheelForceEventThreshold;                      		// 0x001C (0x0004) [0x0000000000000000]              
	float                                              m_fWheelForceMax;                                 		// 0x0020 (0x0004) [0x0000000000000000]              
	struct FString                                     m_sDoorEventOpenFront;                            		// 0x0024 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sDoorEventOpenRearSide;                         		// 0x0030 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sDoorEventOpenRearBack;                         		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sDoorEventCloseFront;                           		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sDoorEventCloseRearSide;                        		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sDoorEventCloseRearBack;                        		// 0x0060 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              m_fMaxEnclosedness;                               		// 0x006C (0x0004) [0x0000000000000000]              
	struct FString                                     m_sDamageType;                                    		// 0x0070 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sLC_VehicleType;                                		// 0x007C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sSuspensionType;                                		// 0x0088 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct APBGame.cSDDVehicle.VehicleUICategory
// 0x0010
struct FVehicleUICategory
{
	unsigned char                                      m_eVehicleUICategory;                             		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FString                                     m_sDisplayName;                                   		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct APBGame.cSDDVehicle.VehicleTempSetup
// 0x0010
struct FVehicleTempSetup
{
	unsigned char                                      m_eVehicleTempSetup;                              		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FString                                     m_sTempSetupInfo;                                 		// 0x0004 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct APBGame.cSDDVehicle.VehicleDamageLevel
// 0x0010
struct FVehicleDamageLevel
{
	int                                                m_eVehicleDamageLevel;                            		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              m_fHealthThreshold;                               		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                m_eHandlingEffect;                                		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                m_eVehicleCritical;                               		// 0x000C (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.cSDDVehicle.VehicleDamageVFX
// 0x002C
struct FVehicleDamageVFX
{
	int                                                m_eVehicleDamageVFX;                              		// 0x0000 (0x0004) [0x0000000000000000]              
	float                                              m_fHealthThreshold;                               		// 0x0004 (0x0004) [0x0000000000000000]              
	struct FString                                     m_sDamageStateBegin;                              		// 0x0008 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sDamageStateEnd;                                		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sExplosionEvent;                                		// 0x0020 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// ScriptStruct APBGame.cSDDVehicle.VehicleDoorAnimationSet
// 0x0080
struct FVehicleDoorAnimationSet
{
	int                                                m_eVehicleDoorAnimationSet;                       		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     m_sOpenFrame;                                     		// 0x0004 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sOpenFromOutside;                               		// 0x0010 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sOpenGetOut;                                    		// 0x001C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sOpenBailOut;                                   		// 0x0028 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sOpenSeatSlideEjectCriminal;                    		// 0x0034 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sOpenSeatSlideEjectEnforcer;                    		// 0x0040 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sClosedFrame;                                   		// 0x004C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sCloseFromOutside;                              		// 0x0058 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sCloseGetIn;                                    		// 0x0064 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sCloseFromInside;                               		// 0x0070 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	unsigned long                                      m_bDoorOpenWhileInside : 1;                       		// 0x007C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct APBGame.cSDDVehicle.VehicleNPCInsideAnimationSet
// 0x0074
struct FVehicleNPCInsideAnimationSet
{
	int                                                m_eVehicleNPCInsideAnimationSet;                  		// 0x0000 (0x0004) [0x0000000000000000]              
	struct FString                                     m_sEjectInitialCriminal;                          		// 0x0004 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sEjectLaterCriminal;                            		// 0x0010 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sEjectInitialEnforcer;                          		// 0x001C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sEjectLaterEnforcer;                            		// 0x0028 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sEjectInitialFromPassengerSideCriminal;         		// 0x0034 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sEjectLaterFromPassengerSideCriminal;           		// 0x0040 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sEjectInitialFromPassengerSideEnforcer;         		// 0x004C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sEjectLaterFromPassengerSideEnforcer;           		// 0x0058 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	float                                              m_fEjectDistanceDriverSideEnforcer;               		// 0x0064 (0x0004) [0x0000000000000000]              
	float                                              m_fEjectDistanceDriverSideCriminal;               		// 0x0068 (0x0004) [0x0000000000000000]              
	float                                              m_fEjectDistancePassengerSideEnforcer;            		// 0x006C (0x0004) [0x0000000000000000]              
	float                                              m_fEjectDistancePassengerSideCriminal;            		// 0x0070 (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.cSDDVehicle.VehiclePlayerAnimationSet
// 0x0030
struct FVehiclePlayerAnimationSet
{
	int                                                m_eVehiclePlayerAnimationSet;                     		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bMirrorAnimations : 1;                          		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              m_fLeanInDuration;                                		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              m_fLeanOutDuration;                               		// 0x000C (0x0004) [0x0000000000000000]              
	struct FString                                     m_sDriveSteer;                                    		// 0x0010 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sPassengerIdle;                                 		// 0x001C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                m_eAnimTreeDecision;                              		// 0x0028 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bReverseAim : 1;                                		// 0x002C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct APBGame.cSDDVehicle.VehiclePositionInfo
// 0x001C
struct FVehiclePositionInfo
{
	int                                                m_eVehicleAnimationCategory;                      		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_eVehiclePositionIndex;                          		// 0x0004 (0x0001) [0x0000000000000000]              
	int                                                m_eVehiclePlayerAnimationSet;                     		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                m_eVehicleDoorAnimationSet;                       		// 0x000C (0x0004) [0x0000000000000000]              
	int                                                m_nVCPDirection;                                  		// 0x0010 (0x0004) [0x0000000000000000]              
	int                                                m_nVCPAngle;                                      		// 0x0014 (0x0004) [0x0000000000000000]              
	int                                                m_eVehicleNPCInsideAnimationSet;                  		// 0x0018 (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.cSDDVehicle.VehicleSetupType
// 0x01F8
struct FVehicleSetupType
{
	unsigned char                                      m_eVehicleSetupType;                              		// 0x0000 (0x0001) [0x0000000000000000]              
	int                                                m_eVehicleAnimationCategory;                      		// 0x0004 (0x0004) [0x0000000000000000]              
	int                                                m_nCabinCargoPipCapacity;                         		// 0x0008 (0x0004) [0x0000000000000000]              
	int                                                m_nMainCargoPipCapacity;                          		// 0x000C (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bHasRearSeats : 1;                              		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      m_bIsPlayerOnlyVehicle : 1;                       		// 0x0010 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned char                                      m_eVehicleModelClass;                             		// 0x0014 (0x0001) [0x0000000000000000]              
	int                                                m_nCargoAreaSeatPositions;                        		// 0x0018 (0x0004) [0x0000000000000000]              
	struct FString                                     m_sVehicleSetupAsset;                             		// 0x001C (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	int                                                m_nMaxHealth;                                     		// 0x0028 (0x0004) [0x0000000000000000]              
	float                                              m_fMaxRepairTimeSecs;                             		// 0x002C (0x0004) [0x0000000000000000]              
	int                                                m_nMaxRepairCost;                                 		// 0x0030 (0x0004) [0x0000000000000000]              
	int                                                m_eVehicleCategory;                               		// 0x0034 (0x0004) [0x0000000000000000]              
	float                                              m_fRamraidDamageMultiplier;                       		// 0x0038 (0x0004) [0x0000000000000000]              
	float                                              m_fBreakInCSADuration;                            		// 0x003C (0x0004) [0x0000000000000000]              
	int                                                m_ePedestrianDriver;                              		// 0x0040 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bHasAlarm : 1;                                  		// 0x0044 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                m_nSpawnCost;                                     		// 0x0048 (0x0004) [0x0000000000000000]              
	int                                                m_eExplosionType;                                 		// 0x004C (0x0004) [0x0000000000000000]              
	int                                                m_eAudioType;                                     		// 0x0050 (0x0004) [0x0000000000000000]              
	struct FString                                     m_sDisplayName;                                   		// 0x0054 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sPhysicsAsset;                                  		// 0x0060 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	float                                              m_fDriverCamNear;                                 		// 0x006C (0x0004) [0x0000000000000000]              
	float                                              m_fDriverCamFar;                                  		// 0x0070 (0x0004) [0x0000000000000000]              
	float                                              m_fCamBaseZNear;                                  		// 0x0074 (0x0004) [0x0000000000000000]              
	float                                              m_fCamBaseZFar;                                   		// 0x0078 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_eDriveType;                                     		// 0x007C (0x0001) [0x0000000000000000]              
	float                                              m_fFrontWheelMeshOffset[ 0x3 ];                   		// 0x0080 (0x000C) [0x0000000000000000]              
	float                                              m_fFrontWheelBoneOffset[ 0x3 ];                   		// 0x008C (0x000C) [0x0000000000000000]              
	float                                              m_fRearWheelMeshOffset[ 0x3 ];                    		// 0x0098 (0x000C) [0x0000000000000000]              
	float                                              m_fRearWheelBoneOffset[ 0x3 ];                    		// 0x00A4 (0x000C) [0x0000000000000000]              
	float                                              m_fFrontWheelRadius;                              		// 0x00B0 (0x0004) [0x0000000000000000]              
	float                                              m_fRearWheelRadius;                               		// 0x00B4 (0x0004) [0x0000000000000000]              
	float                                              m_fFrontSuspensionTravel;                         		// 0x00B8 (0x0004) [0x0000000000000000]              
	float                                              m_fRearSuspensionTravel;                          		// 0x00BC (0x0004) [0x0000000000000000]              
	float                                              m_fFrontSuspensionSpeed;                          		// 0x00C0 (0x0004) [0x0000000000000000]              
	float                                              m_fRearSuspensionSpeed;                           		// 0x00C4 (0x0004) [0x0000000000000000]              
	float                                              m_fFrontLongFactor;                               		// 0x00C8 (0x0004) [0x0000000000000000]              
	float                                              m_fFrontLatFactor;                                		// 0x00CC (0x0004) [0x0000000000000000]              
	float                                              m_fRearLongFactor;                                		// 0x00D0 (0x0004) [0x0000000000000000]              
	float                                              m_fRearLatFactor;                                 		// 0x00D4 (0x0004) [0x0000000000000000]              
	float                                              m_fRearHandbrakeLong;                             		// 0x00D8 (0x0004) [0x0000000000000000]              
	float                                              m_fRearHandbrakeLat;                              		// 0x00DC (0x0004) [0x0000000000000000]              
	float                                              m_fGearRatios[ 0x6 ];                             		// 0x00E0 (0x0018) [0x0000000000000000]              
	float                                              m_fIdleRPM;                                       		// 0x00F8 (0x0004) [0x0000000000000000]              
	float                                              m_fLSDFactor;                                     		// 0x00FC (0x0004) [0x0000000000000000]              
	float                                              m_fRedlineRPM;                                    		// 0x0100 (0x0004) [0x0000000000000000]              
	float                                              m_fFinalDriveRatio;                               		// 0x0104 (0x0004) [0x0000000000000000]              
	float                                              m_f2ndGearSpeed;                                  		// 0x0108 (0x0004) [0x0000000000000000]              
	float                                              m_f3rdGearSpeed;                                  		// 0x010C (0x0004) [0x0000000000000000]              
	float                                              m_f4thGearSpeed;                                  		// 0x0110 (0x0004) [0x0000000000000000]              
	float                                              m_f5thGearSpeed;                                  		// 0x0114 (0x0004) [0x0000000000000000]              
	float                                              m_f500RpmTorque;                                  		// 0x0118 (0x0004) [0x0000000000000000]              
	float                                              m_f2500RpmTorque;                                 		// 0x011C (0x0004) [0x0000000000000000]              
	float                                              m_f4500RpmTorque;                                 		// 0x0120 (0x0004) [0x0000000000000000]              
	float                                              m_f7000RpmTorque;                                 		// 0x0124 (0x0004) [0x0000000000000000]              
	float                                              m_fWheelLatAsymptoteSlip;                         		// 0x0128 (0x0004) [0x0000000000000000]              
	float                                              m_fWheelLatAsymptoteValue;                        		// 0x012C (0x0004) [0x0000000000000000]              
	float                                              m_fWheelLatExtremumSlip;                          		// 0x0130 (0x0004) [0x0000000000000000]              
	float                                              m_fWheelLatExtremumValue;                         		// 0x0134 (0x0004) [0x0000000000000000]              
	float                                              m_fWheelLongAsymptoteSlip;                        		// 0x0138 (0x0004) [0x0000000000000000]              
	float                                              m_fWheelLongAsymptoteValue;                       		// 0x013C (0x0004) [0x0000000000000000]              
	float                                              m_fWheelLongExtremumSlip;                         		// 0x0140 (0x0004) [0x0000000000000000]              
	float                                              m_fWheelLongExtremumValue;                        		// 0x0144 (0x0004) [0x0000000000000000]              
	float                                              m_fSuspensionDamping;                             		// 0x0148 (0x0004) [0x0000000000000000]              
	float                                              m_fSuspensionStiffness;                           		// 0x014C (0x0004) [0x0000000000000000]              
	float                                              m_fChassisTorqueFactor;                           		// 0x0150 (0x0004) [0x0000000000000000]              
	float                                              m_fEngineBrakingFactor;                           		// 0x0154 (0x0004) [0x0000000000000000]              
	float                                              m_fMaxBrakeTorque;                                		// 0x0158 (0x0004) [0x0000000000000000]              
	float                                              m_fReverseThrottle;                               		// 0x015C (0x0004) [0x0000000000000000]              
	float                                              m_fSteerSpeed;                                    		// 0x0160 (0x0004) [0x0000000000000000]              
	float                                              m_f0msSteerAngle;                                 		// 0x0164 (0x0004) [0x0000000000000000]              
	float                                              m_f12msSteerAngle;                                		// 0x0168 (0x0004) [0x0000000000000000]              
	float                                              m_f22msSteerAngle;                                		// 0x016C (0x0004) [0x0000000000000000]              
	struct FString                                     m_sVehicleName;                                   		// 0x0170 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	float                                              m_fCOMOffsetX;                                    		// 0x017C (0x0004) [0x0000000000000000]              
	float                                              m_fCOMOffsetZ;                                    		// 0x0180 (0x0004) [0x0000000000000000]              
	float                                              m_fMaxSpeed;                                      		// 0x0184 (0x0004) [0x0000000000000000]              
	float                                              m_fBlobShadowScale[ 0x3 ];                        		// 0x0188 (0x000C) [0x0000000000000000]              
	float                                              m_fBlobShadowTranslate[ 0x3 ];                    		// 0x0194 (0x000C) [0x0000000000000000]              
	unsigned char                                      m_eUICategory;                                    		// 0x01A0 (0x0001) [0x0000000000000000]              
	unsigned char                                      m_eTempAssets;                                    		// 0x01A1 (0x0001) [0x0000000000000000]              
	float                                              m_fCollisionDamage;                               		// 0x01A4 (0x0004) [0x0000000000000000]              
	int                                                m_nInitialCamPitch;                               		// 0x01A8 (0x0004) [0x0000000000000000]              
	int                                                m_nCameraPitchMin;                                		// 0x01AC (0x0004) [0x0000000000000000]              
	int                                                m_nCameraPitchMax;                                		// 0x01B0 (0x0004) [0x0000000000000000]              
	int                                                m_eUIMeshViewerSetup;                             		// 0x01B4 (0x0004) [0x0000000000000000]              
	float                                              m_fPercentPerfectlyClean;                         		// 0x01B8 (0x0004) [0x0000000000000000]              
	float                                              m_fPercentDirty;                                  		// 0x01BC (0x0004) [0x0000000000000000]              
	float                                              m_fMinDust;                                       		// 0x01C0 (0x0004) [0x0000000000000000]              
	float                                              m_fMaxDust;                                       		// 0x01C4 (0x0004) [0x0000000000000000]              
	float                                              m_fMinDirt;                                       		// 0x01C8 (0x0004) [0x0000000000000000]              
	float                                              m_fMaxDirt;                                       		// 0x01CC (0x0004) [0x0000000000000000]              
	float                                              m_fMaxReverseSpeed;                               		// 0x01D0 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bHasTailLights : 1;                             		// 0x01D4 (0x0004) [0x0000000000000000] [0x00000001] 
	int                                                m_eGameplayObject;                                		// 0x01D8 (0x0004) [0x0000000000000000]              
	struct FString                                     m_sVFXPrefab;                                     		// 0x01DC (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	struct FString                                     m_sSharedDataObject;                              		// 0x01E8 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	float                                              m_fSteerAccel;                                    		// 0x01F4 (0x0004) [0x0000000000000000]              
};

// ScriptStruct APBGame.cAPBPawnAnimation.AnimationRequest
// 0x001D
struct FAnimationRequest
{
	class UcAnimationDescriptor*                       m_Animation;                                      		// 0x0000 (0x0004) [0x0000000000000000]              
	class AcAnimationDrivenTrigger*                    m_Trigger;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
	float                                              m_StartLocationX;                                 		// 0x0008 (0x0004) [0x0000000000000000]              
	float                                              m_StartLocationY;                                 		// 0x000C (0x0004) [0x0000000000000000]              
	float                                              m_StartLocationZ;                                 		// 0x0010 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_ePhysicsOverride;                               		// 0x0014 (0x0001) [0x0000000000000000]              
	int                                                m_NetworkTag;                                     		// 0x0018 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_Action;                                         		// 0x001C (0x0001) [0x0000000000000000]              
};

// ScriptStruct APBGame.cAPBPawnAnimation.tCarAnimation
// 0x000C
struct FtCarAnimation
{
	class AcAPBVehicleBase*                            m_Vehicle;                                        		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_eVehicleSeat;                                   		// 0x0004 (0x0001) [0x0000000000000000]              
	unsigned char                                      m_eVehicleInteractionAnimation;                   		// 0x0005 (0x0001) [0x0000000000000000]              
	unsigned long                                      m_bMirror : 1;                                    		// 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct APBGame.cAPBPawnAnimation.OnFootDeathAnimation
// 0x0014
struct FOnFootDeathAnimation
{
	unsigned char                                      m_eOnFootDeathAnimation;                          		// 0x0000 (0x0001) [0x0000000000000000]              
	struct FString                                     m_sAnimName;                                      		// 0x0004 (0x000C) [0x0000000000500000]              ( CPF_NeedCtorLink )
	unsigned long                                      m_bRetainMomentum : 1;                            		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct APBGame.cAnimationDescriptor.AnimationDescriptor
// 0x0014
struct FAnimationDescriptor
{
	int                                                m_eAnimationDescriptor;                           		// 0x0000 (0x0004) [0x0000000000000000]              
	unsigned long                                      m_bFreezeCameraLoc : 1;                           		// 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              m_fStaminaDrain;                                  		// 0x0008 (0x0004) [0x0000000000000000]              
	unsigned char                                      m_eRCEType;                                       		// 0x000C (0x0001) [0x0000000000000000]              
	unsigned long                                      m_bResetLocomotion : 1;                           		// 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct APBGame.cAnimConfigureDecision.tDecisionChild
// 0x0018
struct FtDecisionChild
{
